'''
认识函数：在一个完整的项目中，某些功能会反复地被使用，那么，
我们会将功能封装成函数，当我们要使用功能的时候直接调用函数即可

本质：函数就是对功能的封装

优点：
1、简化代码结构，增加了代码的复用度(重复使用的程度)
2、如果想修改某些功能或者修改某个BUG,还需要修改对应的函数即可

'''

'''
定义函数：

格式：
def 函数名(参数列表)：   #参数列表指由参数1,参数2,......参数n组成的
    语句
    return 表达式
    
    
def：函数代码块以def关键字开始
函数名：一般遵循标识符规则
参数列表(参数1,参数2,......参数n):任何传入函数的参数和变量必须放在圆括号之间，用逗号分隔。
                              函数从函数的调用者那里获取的信息
冒号：函数内容(封装的功能)以冒号开始，并且注意缩进
语句：函数封装的功能
return：一般用于结束函数，并返回信息给函数的调用者
表达式：即为要返回给函数的调用者的信息

注意：最后的return表达式可以不写，若没有写，相当于return None
'''

'''
函数的调用

格式：函数名(参数列表)
函数名：是要使用的功能的函数的函数名字
参数列表：函数的调用者给函数传递的信息，如果没有参数，小括号也需要加上

函数调用的本质：实参给形参赋值的
'''

